US1GHQ/ESP32_LoRa_APRS_SARIMESH/src/ESP32_Sarimesh_Core_Vr_4.0.2.cpp
//**************** support for LITTLEFS *********************
// from  https://github.com/lorol/LITTLEFS now in the standard libs
#include <FS.h>
#include <LittleFS.h> 

// Our local FS will be on the internal SPI flash of the esp32 board
fs::FS localFs = LittleFS;
volatile bool has_LittleFS = false;           // willl be asserted by autodiscovery

// *******************  hardware serial interface support in esp32 ****************************
// mandatory to use serial interfaces 1 and 2 ; interface 0 is mapped over the USB and is not physically accessible on board
// Serial HW device support
#include <HardwareSerial.h>
HardwareSerial Esp32Serial1(1); // GPS
HardwareSerial Esp32Serial2(2); // DRA828
Stream * aSerial;

//******************************** GPS support via TinyGPSPlus Library for ESP32 *****************
// TinyGPSPlus  https://github.com/mikalhart/TinyGPSPlus
// include local GPS support functions
#ifdef GPS_MOD
 volatile bool no_gps = false;
#else
 volatile bool no_gps = true;
#endif
#include "GPS_Support_Functions.h"

//******************   support for ezTime high precision time library ***************************
// ezTime library  https://github.com/ropg/ezTime
#include "ezTime_loc.h" // local copy patched by MF for GPS/RTC addition to NTP sync

// ******************* RTC DS3231 & PPS_Support_Functions support ******************************
#include "PPS_Support_Functions.h"       // defines timers and ISR
#include "DS3231_Support_Functions.h"
RtcDS3231<TwoWire> Rtc(Wire);

//************************************ EEPROM ***********************************************
#include <EEPROM.h>

//******************   support for wifi/ethernet/NTP/mDNS/Syslog  ***************************
// include support for WiFi interface
#include "WiFi_Support_Functions.h"
// WiFi Related data  local AP address for GUI support
IPAddress apIP(192, 168, 5, 1);
byte DNS_PORT = 53;
DNSServer dnsServer;
WiFiMulti wifiMulti;
//how many clients should be able to telnet to this ESP32
//WiFiClient serverClients[MAX_SRV_CLIENTS];
WebServer web_server(80);       // The Webserver for GUI
WiFiServer Kiss_server(10001);  // KISS_Over_TCP server
WiFiClient Kiss_client ;        // client definition for listening on  kiss_server incoming clients
WiFiUDP UDPNTPClient;           // used by NTP Client for NTP server interaction
// private LoRa GeoLocator server support
// direwolf log report support
// by MF 20200818
// IP address to send UDP data to.
// it can be ip address of the server or 
// a network broadcast address
// here is broadcast address
//create UDP instance
String udpAddress = "192.168.2.150";
int udpPort = 44444;
WiFiUDP udp;     // this is the cochet for talking with remote udp server repository

//Syslog syslog(syslogClient, SYSLOG_PROTO_IETF);   // Create a new empty syslog instance
WiFiUDP syslogClient;           // A syslog instance to let us send and receive packets over UDP to a remote syslog server to collect our log messages
Syslog syslog(syslogClient, SYSLOG_PROTO_BSD);   // Create a new empty syslog instance
String SyslogDeviceName = "TBD";

//******************* OTA support *********************************
#ifdef USE_ARDUINO_OTA
  #include <ArduinoOTA.h>
  WebServer HTTPServer(88);
#endif

//******************* Common Remote and  Serial Debug support *********************************
#ifdef FORCE_SERIAL_DEBUG  
// SerialDebug Library
// Disable all debug ? Good to release builds (production)
// as nothing of SerialDebug is compiled, zero overhead :-)
// For it just uncomment the DEBUG_DISABLED
//#define DEBUG_DISABLED true

// Disable SerialDebug debugger ? No more commands and features as functions and globals
// Uncomment this to disable it 
//#define DEBUG_DISABLE_DEBUGGER true   // not used in this project

// Debug TAG ?
// Usefull with debug any modules
// For it, each module must have a TAG variable:
//     const char* TAG = "...";
// Uncomment this to enable it
//#define DEBUG_USE_TAG true

// Define the initial debug level here (uncomment to do it)
// #define DEBUG_INITIAL_LEVEL DEBUG_LEVEL_VERBOSE

  #include "SerialDebug.h" //https://github.com/JoaoLopesF/SerialDebug
#else
  #include "RemoteDebug.h"        //https://github.com/JoaoLopesF/RemoteDebug
#endif

#ifndef DEBUG_DISABLED          // Only if debug is not disabled (for production/release)
// RemoteDebug related variables
// Disable the auto function feature of RemoteDebug  Good if your code already have func name on debug messages
//#define DEBUG_DISABLE_AUTO_FUNC true
// Disable Websocket This is used with RemoteDebugApp connection
//#define WEBSOCKET_DISABLED true
#ifndef WEBSOCKET_DISABLED // Only if Web socket enabled (RemoteDebugApp) If enabled, you can change the port here (8232 is default)
  #define WEBSOCKET_PORT 8232
  // Internally, the RemoteDebug uses a local copy of the arduinoWebSockets library (https://github.com/Links2004/arduinoWebSockets)
  // Due it not in Arduino Library Manager If your project already use this library, Uncomment the line below, to do it:
  #define USE_LIB_WEBSOCKET true
#endif 
#endif

void Debug_Loop(void) ;
void RemoteDebug_Setup(void) ;
void SerialDebug_Setup(void) ;


//*******************************   WebConfig vr 1.1.3 support  ***************************
#include "global.h"                  // includes default webconfig configuration 
#define ServerVersion "1.0"          // GUI server reference version
#include "File_Download_Upload.h"    // save/load configuration support
#include "helpers.h"
volatile bool WebConfig_debug ;      // to debug webConfig 
byte packetBuffer[ NTP_PACKET_SIZE]; 

// local AP address for GUI support
IPAddress ap_local_ip(192,168,5,1);
IPAddress ap_gateway(192,168,5,1);
IPAddress ap_subnet(255,255,255,0) ;


//****************************** web_client Test  setup ***************************************
#ifdef WEBCLIENT_TEST_ENABLE  
#ifdef WIFI_UPSTREAM
  WiFiClient web_client; // Initialize the WiFi web_client
#endif
#endif


//************************* HiveMQ Brocker Setup *********************************
#ifdef HMQ_MQTT_ENABLE  
  // https://www.survivingwithandroid.com/esp32-mqtt-client-publish-and-subscribe/
  // to test use http://www.hivemq.com/demos/websocket-client/
  //   subscribe  /micfuc2020/replay   publish  /micfuc2020/commands
  #define HMQ_SERVER      "96a46d5d34ba46b88464e911a9d5f064.s1.eu.hivemq.cloud"
  #define HMQ_SERVERPORT  8883
  #define HMQ_USERNAME    "micfuc2020"
  #define HMQ_PASSWORD    "Papera_123"

