US1GHQ/ESP32_LoRa_APRS_SARIMESH/src/ESP32_Sarimesh_Core_Vr_4.0.2.cpp
  // this is the public MQTT server HMQ
  char *HMQ_mqttServer = (char *)"broker.hivemq.com";
  int HMQ_mqttPort = 1883;
  //char *HMQ_mqttServer = (char *)HMQ_SERVER;
  //int HMQ_mqttPort = HMQ_SERVERPORT;

  uint32_t HMQ_last_time = millis(); 
  uint8_t HMQ_cntr = 0; 
  uint32_t HMQ_last_connect_trial = millis(); 

  #include <PubSubClient.h>

  #ifdef WIFI_UPSTREAM
    WiFiClient HMQ_Client;  // HMQ MQTT client instance
    PubSubClient mqttClient(HMQ_Client); 
  #endif
#endif

//************************* MQTT VPN Setup *********************************
#ifdef HMQ_MQTT_VPN_ENABLE
  #include "mqttif.h"
  // VPN settings
  char* vpn_broker = "mqtt://broker.hivemq.com:1883";
  char* vpn_mqtt_user = "micfuc2020";
  char* vpn_mqtt_password = "Papera_123";
  char* vpn_password = "auguri";
  ip4_addr_t vpn_ipaddr;
  ip4_addr_t vpn_netmask;
  ip4_addr_t vpn_gw;
#endif

//*********************** Adafruit.io initialize MQTT protocol support
#ifdef AIO_MQTT_ENABLE  
  #include "Adafruit_MQTT.h"
  #include "Adafruit_MQTT_Client.h"
  #include "MQTT_test_case.h"
  uint32_t AIO_last_time = millis(); 
  uint8_t AIO_cntr = 0; 

  //************************* Adafruit.io Brocker Setup *********************************
  #define AIO_SERVER      "io.adafruit.com"
  #define AIO_SERVERPORT  1883
  #define AIO_USERNAME    "micfuc2020"
  #define AIO_KEY         "aio_CTVA815UG8zgtbvelXUgyc9JbNdn"

  #ifdef WIFI_UPSTREAM
    WiFiClient mqtt_client; //Set up the wifi client
    Adafruit_MQTT_Client mqtt(&mqtt_client, AIO_SERVER, AIO_SERVERPORT, AIO_USERNAME, AIO_KEY);
    #define halt(s) { Serial.println(F( s )); while(1);  }

    //******************************  Adafruit MQTT Feed setup ***************************************
    // https://io.adafruit.com/micfuc2020/dashboards
    // Setup a feed called 'photocell' for publishing.
    // Notice MQTT paths for AIO follow the form: <username>/feeds/<feedname>
    Adafruit_MQTT_Publish photocell = Adafruit_MQTT_Publish(&mqtt,  AIO_USERNAME "/feeds/photocell");

    // Setup a feed called 'onoff' for subscribing to changes.
    Adafruit_MQTT_Subscribe onoffbutton = Adafruit_MQTT_Subscribe(&mqtt, AIO_USERNAME "/feeds/onoff");
  #endif
#endif

// **********************  SPI  devices support *******************
#include <SPI.h>

//**************************** support for OLED and TFT display  *************************
#include <Adafruit_GFX.h>    // Core graphics library
#include <Fonts/FreeMonoBoldOblique12pt7b.h>
#include <Fonts/FreeMono9pt7b.h>
#include "FONTS/Basic_Comical_Regular_NC12pt7b.h"
#include "FONTS/Basic_Comical_Regular_NC11pt7b.h"
#include "FONTS/Basic_Comical_Regular_NC10pt7b.h"
#include "FONTS/Basic_Comical_Regular_NC9pt7b.h"
#include "FONTS/Basic_Comical_Regular_NC8pt7b.h"
#include "FONTS/Basic_Comical_Regular_NC7pt7b.h"
#include "FONTS/Basic_Comical_Regular_NC6pt7b.h"

#ifdef TFT_MOD
  #ifdef USE_ADAFRUIT_TFT_LIB 
    // SPI ST7735/7789 based TFT display + SD card support
    #include <Adafruit_ST7735.h> // Hardware-specific library for ST7735
    #include <Adafruit_ST7789.h> // Hardware-specific library ffor ST7789
    // create tft object
    //Adafruit_ST7735 tft = Adafruit_ST7735(TFT_CS, TFT_DC, TFT_RST);
    Adafruit_ST7789 tft = Adafruit_ST7789(TFT_CS, TFT_DC, TFT_RST);      // 1.14" display
  #else
    // SPI TFT_eSPI ST7735 display support
    #include <TFT_eSPI.h> // Hardware-specific library local copy patched for compatibiity with adafruit libraries
    #include "FONTS/Comics_16.h"
    #include "FONTS/Comics_18.h"
    #include "FONTS/Comics_20.h"
    #include "FONTS/Free_Fonts.h" // Include the header file attached to this sketch
    TFT_eSPI tft = TFT_eSPI();       // Invoke custom library
  #endif
#endif   // TFT_MOD


//*************************** SSD1306 OLED Display support *****************************************
#ifdef OLED_MOD
  #ifdef USE_SSD1306_ASCII_LIB
    #include "SSD1306Ascii.h"
    #include "SSD1306AsciiWire.h"
    SSD1306AsciiWire display;
  #else                                // OLED display support via adafruit OLED library
    #include <Adafruit_SSD1306.h>
    #define SCREEN_WIDTH 128 // OLED display width, in pixels
    #define SCREEN_HEIGHT 64 // OLED display height, in pixels
    #ifdef O_RST     // Define proper RST_PIN if required.
      //  Adafruit_SSD1306 display(SCREEN_WIDTH, SCREEN_HEIGHT, &Wire, O_RST);
      Adafruit_SSD1306 display(SCREEN_WIDTH, SCREEN_HEIGHT, &Wire, oled_rst); 
    #else
      Adafruit_SSD1306 display(SCREEN_WIDTH, SCREEN_HEIGHT, &Wire );
    #endif
        //  #include "OLED_test_case.h"
  #endif
#endif   // OLED_MOD

//***************************************** SD card support  **************************
#ifdef SD_MOD
  // These are used to get information about static SRAM and flash memory sizes
  extern "C" char __data_start[];    // start of SRAM data
  extern "C" char _end[];     // end of SRAM data (used to check amount of SRAM this program's variables use)
  extern "C" char __data_load_end[];  // end of FLASH (used to check amount of Flash this program's code and data uses)
  // Libraries for SD card
  #include "FS.h"
  #include "SD.h"
  #include "sd_test_case.h"
#endif  // SD_MOD

//*********************  Support for power supply subsystem ******************************************
#ifdef INA219_MOD
  #include <INA219.h>
  INA219 monitor_24(INA219::I2C_ADDR_41 );  // please check module straps setup
  INA219 monitor_5(INA219::I2C_ADDR_44 );   // please check module straps setup
  volatile bool has_INA219_5 ;                // autodiscovery
  volatile bool has_INA219_24 ;                // autodiscovery
  void PS_INA219_get (void) ;
#endif   // INA219_MOD


#ifdef MUX4051_MOD
  // Analog Mux 4051 support
  #include "Mux.h"
  volatile bool has_MUX4051 = true ;

  using namespace admux;
  // Creates a Mux instance.
  //  1st argument is the SIG (signal) pin (Arduino analog input pin A0).
  // 2nd argument is the S0-S3 (channel control) pins (Arduino pins 8, 9, 10, 11).
  admux::Mux mux(Pin(IA0, INPUT, PinType::Analog), Pinset(CS0, CS1));
  uint8_t channels[4]={EN_5V,EN_24V_1, EN_24V_2, EN_24V_3 };
  //double chan_scale[4]={1.707, 9.563, 9.563, 9.563 };
  double chan_scale[4]={3.36, 11.92, 11.92, 11.92 };
  uint8_t chan_status[4]={0,0,0,0 };    // 0 => OFF   < 100 => OFF-counting up   if 100 => ON   > 100 => ON-counting counting down
  double Vin_bat , V24_curr, V5_curr, V24_power, V5_power ;
  double V5_out, V24_out_1, V24_out_2, V24_out_3;
  void Mux_loop();
#else
  volatile bool has_MUX4051 = false ;
#endif // end  MUX4051_MOD

#ifdef PS_FUNCTIONS_ENABLE
  volatile bool has_PS_5V = false ;     // to be confirmed by autodetection
  volatile bool has_PS_24V_1 = false;  
  volatile bool has_PS_24V_2 = false;  
  volatile bool has_PS_24V_3 = false;
  volatile bool V5_ena=0 ;               // enable V5 out channel
  volatile bool V24_1_ena = 0 ;          // enable V24_1 out channel
  volatile bool V24_2_ena = 0 ;          // enable V24_2 out channel
  volatile bool V24_3_ena = 0;           // enable V24_3 out channel
  volatile uint8_t PS_Out_Reset = 0 ;
  volatile bool Bat_discarge = 0 ;
  bool PS_HBT = false;
  void PS_Chan_enable(uint8_t chan);
  void PS_Chan_disable(uint8_t chan);
  double PS_Chan_read(uint8_t chan);
  void PS_Chan_reset(uint8_t chan);
  void PS_Chan_Manager(void);
  void loop_PS();
#endif

// support for SPI bus
#include <SPI.h>

