US1GHQ/ESP32_LoRa_APRS_SARIMESH/src/ESP32_Sarimesh_Core_Vr_4.0.2.cpp
//*********************  init I2C wire.h driver and try to pre-init OLED display  *******************
// try to initialize I2C bus 
Wire.setClock(100000L);
i2c_initialized = false  ; int i2cDevices=0 ; hw_arch=0 ;//  try pin pairs 4,15 or 21,22 
Wire.begin(i2c_sda, i2c_scl); 
I2C_Scanner() ;
i2cDevices=I2C_Scanner_alt() ;
if ( i2cDevices == 0){
  Serial.printf("i2C_init(): NO device found.. may be I2C INIT FAILED: i2c_initialized=%d - i2c_sda=%d  - i2c_scl=%d - running on core=", i2c_initialized, i2c_sda, i2c_scl );   
  Serial.println(xPortGetCoreID());    
  }
else {
  i2c_initialized = true  ;
  if(has_FM24W256 && has_PCF8574 ) hw_arch = 101 ;   // SARIMESH device with FRAM and PCF8574 - iGate PCB
  if(has_FM24W256 && ! has_PCF8574 ) hw_arch = 102 ; // SARIMESH device with FRAM - miniTracker PCB
     
  if( ! has_FM24W256 ){  
    if(i2c_sda == 21) hw_arch = 105 ; // TTGO like device
    if(i2c_sda == 4) hw_arch = 106 ;  // Heltec like device       
    } ;  
  Serial.printf("i2c_init(): SUCCESS: i2cDevices=%d i2c_initialized=%d - hw_arch=%d - i2c_sda=%d  - i2c_scl=%d - running on core=", i2cDevices , i2c_initialized, hw_arch ,i2c_sda, i2c_scl );   
  Serial.println(xPortGetCoreID());    
};

#ifdef OLED_MOD
// try to reset OLED display via software if a reset pin is available and an OLED display is present
if(oled_rst){                 // try to reset OLED display via IOpin just in case
  pinMode(oled_rst, OUTPUT);
  digitalWrite(oled_rst, LOW);
  vTaskDelay(pdMS_TO_TICKS(20));
  digitalWrite(oled_rst, HIGH);
  };
#endif

Serial.printf("i2c_init(): status_display: has_PCF8574=%d - has_DS3231=%d - has_DS3231_eeprom=%d - has_SSD1306=%d - has_FM24W256=%d - running on core=", has_PCF8574, has_DS3231 ,has_DS3231_eeprom, has_SSD1306, has_FM24W256 );   
Serial.println(xPortGetCoreID());    


//************************** init EEPROM based configuration  *************************
  EEPROM.begin(512);  // open EEPROM storage holding the device configration infos

//*************** disable all possible conflicting pins on SPI bus *****************
#ifdef W5500_MOD
  pinMode(W5500_RST, OUTPUT);      // reset for ethernet W5500
  digitalWrite(W5500_RST, HIGH);
#endif

#ifdef LORA_MOD
  pinMode(lora_rst, OUTPUT);      // reset for LoRa 
  digitalWrite(lora_rst, HIGH);
  pinMode(lora_cs, OUTPUT);      // CS for LoRa - 1 CS disable
  digitalWrite(lora_cs, HIGH);
#endif

#ifdef TFT_MOD
  pinMode(TFT_CS, OUTPUT);      // CS for SPI display - 1 CS disable
  digitalWrite(TFT_CS, HIGH);
  pinMode(TFT_DC, OUTPUT);      // CS for SPI display - 1 DC disable
  digitalWrite(TFT_DC, LOW);
#endif

#ifdef SD_MOD
  pinMode(SD_CS, OUTPUT);      // CS for SD Card - 1 CS disable
  digitalWrite(SD_CS, HIGH);
  pinMode(SD_RST, OUTPUT);      // CS for SD Card - 1 CS disable
  digitalWrite(SD_RST, HIGH);     
#endif

//******************** init driver for PCF8574 port expander connected devices ***************************
if(has_PCF8574){                                     // setup port expander
  debugA("\rSetup port expander pcf8574... (LastFunction=%s\r)", LastFunction.c_str());

  #ifndef PWRS_MOD
     // Set pinMode to OUTPUT or INPUT for LoRa Tracker
     pcf8574.pinMode(P7, OUTPUT);  // green led
     pcf8574.pinMode(P6, OUTPUT);  // red led
     pcf8574.pinMode(P5, INPUT);   // pushbutton
     pcf8574.pinMode(P4, OUTPUT);  // ex buzzer
  #else
     // Set pinMode to OUTPUT or INPUT for PS
     pcf8574.pinMode(P0, OUTPUT);  // EN_5V
     pcf8574.pinMode(P1, OUTPUT);  // EN_24V_1
     pcf8574.pinMode(P2, OUTPUT);   // EN_24V_2
     pcf8574.pinMode(P3, OUTPUT);  // EN_24V_3
     pcf8574.pinMode(P4, OUTPUT);  // EXT_REL
     pcf8574.pinMode(P5, INPUT);   // PB
     pcf8574.pinMode(P6, OUTPUT);  // G_LD
     pcf8574.pinMode(P7, OUTPUT);  // R_LD  
  #endif
  
  // initialize pcf8574 library
  if (pcf8574.begin()){
    debugA("success");
       }
  else{
    debugA("Failed: PCF8574 discovered but not working --> assume has_PCF8574=0 ");
    has_PCF8574 = false;   
      };
    } 
else{    // no port expander available
  if(green_led){
    pinMode(green_led, OUTPUT);      // if no pcf8574 this is the Green_LED (mini Tracker case)
    digitalWrite(green_led, LOW);   
    };
  if(red_led){
    pinMode(red_led, OUTPUT);      // if no pcf8574  this is the red_LED (mini Tracker case)
    digitalWrite(red_led, LOW);   
    };
};  // end of has_PCF8574 
 
// test red/green leds
green_flash();            // flash green led
red_flash();              // flash red led 
vTaskDelay(pdMS_TO_TICKS(1000));
green_red_flash();        // flash red and green leds
soundBuzzer();            // beep buzzer

debugA("Setup(): I2C led/buzzer init completed.(LastFunction=%s)\r", LastFunction.c_str());


//******************** initilize FRAM storage ***************************

if(has_FM24W256){
   debugA("Initialize FRAM device access....");
   int rv;
   if(i2c_sda){ rv = fram.begin(i2c_sda,i2c_scl,0x50);} else { rv = fram.begin(0x50);};
   if (rv != 0){
      Serial.print(rv);
      };
   // Serial.print("FRAM ManufacturerID: ");
   // Serial.println(fram.getManufacturerID());
   // Serial.print("     ProductID: ");
   // Serial.println(fram.getProductID());
   // Serial.print("     memory size: ");
   // Serial.println(fram.getSize());
   debugA("done");
};

//******************** initialize LITTLEFS ***************************
#include "LittleFS_Support_Functions.h"

debugA("Setup LittleFS volume... ");
#define FORMAT_LITTLEFS_IF_FAILED true
if(!LittleFS.begin(FORMAT_LITTLEFS_IF_FAILED)){
  debugA("LittleFS Mount Failed");
  has_LittleFS = false;
  } 
else{
  has_LittleFS = true;
  };
debugA("done");

//  LittleFS.remove("/WebConf.conf");  / to remove a file...

bool selftest_debug= false ;
if(selftest_debug){
  debugA("\n\r==================== running LITTLEFS unit test case ==========================\r");
  ut_littlefs_setup();
  debugA("\r================= WebConf.conf file dump from LITTLEFS =========================");
  File file = LittleFS.open("/WebConf.conf");  // sample file access
  if(!file){ 
    Serial.println("Failed to open /WebConf.conf file for reading");
    }
  else {
    listDir(LittleFS, "/", 2);
    debugA("/WebConf.conf file Content:");
    while(file.available()){
      Serial.write(file.read());
      };
    file.close();
  };
  debugA_loc("\n\r==================== end of LITTLEFS test case ==========================\r\n");
};



//******************** Restore to Factory default  ***************************

// open  time windows to load default configuration
Serial.print("\n\r--------------> Open wait_default_config time window... \r\n");
wait_default_config = true   ;   
RED_LED_enable();
GREEN_LED_enable();
int cntrx = 100;
while (cntrx--) {
  vTaskDelay(pdMS_TO_TICKS(50));
  Serial.print("*");
  check_button();
  };
Serial.println("*");
RED_LED_disable();
GREEN_LED_disable();
wait_default_config = false  ; 
Serial.println("--------------> Close wait_default_config time window \r");

// close default config loading on startup time window


//******************** load or initialize device configuration from FRAM or LittleFS ***************************
// if no config is found a default config is loaded: hence after this step a valid configuration should be always available.

// force_config_init= true ; // to test forcing default configuration
if (LoadConfig( force_config_init ) == false) Serial.print("Failed loading Device configurations: forced default configuration\r\n");

// assuming AprsLogin from the device configuration as official NodeName
NodeName = ESP_Config.AprsLogin ;

//DisplayConfig_serial(); 
Serial.print("We should have here a valid configuration... either the default or the custom one.... \r\n");  
    
// These data are hardcoded in this SW build
ESP_Config.SW_Revision = SW_Revision ;  // force present SW version
ESP_Config.cpu_type = CPU_TYPE ;  // force present cpu_type
AdminEnabled = true;  // start with admin mode enabled 

// update local variables, configuration dependent; this customize such parameters according to device NVM based configuration
Serial.print("Update now local runtime variables, configuration dependent; this customize such parameters according to device NVM based configuration\r\n");
UpdateLocalConfigData();    //  implements the current configuration in the run time status of this device

//******************** test for spurious reboot ***************************
RebootTag = 0 ;          // check for spurios system reboot
if( has_FM24W256 ){  
  RebootTag = fram.read8(2015);
  if (RebootTag != 123 ){
    // write_event_to_log("========= SPURIOUS system reboot discovered ===========");
    debugA("\r\n\r\n\r\n==== SPURIOUS system reboot discovered  RebootTag=%d - Forcing clean reboot =======\r\n", RebootTag);
    RebootTag = 123 ;
    fram.write8(2015,RebootTag);
    vTaskDelay(pdMS_TO_TICKS(1000));
    RebootTag = 0;
    RebootTag = fram.read8(2015);
    if( RebootTag == 123) Serial.printf("===> Reboot tag correctly written to FRAM ..."); 
      debugA("===> Rebooting...");         
      pinMode(14, OUTPUT);      // hard reset 
      digitalWrite(14, LOW); 
      }
    else {
      // write_event_to_log("========= CLEAN system reboot found ===========");
      debugA("\r\n\r\n========= CLEAN system reboot found  RebootTag=%d ===========\r\n", RebootTag);
      RebootTag = 0 ;
      fram.write8(2015,RebootTag);
      vTaskDelay(pdMS_TO_TICKS(1000));         
      };  
    };

  // fix syslog_enable / standalone
  //  standalone = false ; syslog_enable = false ;  wifi_enable = false ;  LoRa_debug = 0; APRS_debug =0 ;   no_gps = false ; 

  //      ESP_Config.AprsRawBeaconIGATE = "I1XYZ-10,WIDE1-1,LoRa iGate,#,L";
  //      ESP_Config.AprsRawBeaconTRACK = "I1XYZ-10,WIDE1-1,LoRa Tracker,#,L" ;


//*********************************** OLED DISPLAY HW  setup  *******************


#ifdef OLED_MOD
    #ifdef USE_SSD1306_ASCII_LIB
     Serial.print( "Using SSD1306_ASCII_LIB LIB\r\n" );
    #else
     Serial.print( "Using Adafruit SSD1306_LIB LIB\r\n" );
    #endif

    if(has_SSD1306){
    #ifdef USE_SSD1306_ASCII_LIB   // use USE_SSD1306_ASCII_LIB
      if (oled_rst > 0){
        display.begin(&Adafruit128x64, oled_addr, oled_rst);
        }
      else { 
        display.begin(&Adafruit128x64, oled_addr);
      };
      display.displayRemap(true);
      //  display.setFont(X11fixed7x14);
      display.setFont(Arial14);
      display.setContrast(200);
      display.clear();
      display.setRow(1); 
      display.println("        Welcome to");  
      display.setRow(3);
      display.println("Esp32 LoRa Beacon ");  
      display.setRow(5);
      display.println("       by SARIMESH");
    #else   // Adafruit OLED SSD1306 library
      if(oled_rst){                      // For Heltec WiFi LoRa 32 
        pinMode(oled_rst,OUTPUT);
        digitalWrite(oled_rst, LOW);    // set GPIO16 low to reset OLED
        vTaskDelay(pdMS_TO_TICKS(50));
        digitalWrite(oled_rst, HIGH);   // while OLED is running, must set GPIO16 in high
      };
 
     if(!display.begin(SSD1306_SWITCHCAPVCC, oled_addr , false, false)) { // Address 0x3C for 128x32
        Serial.println("SSD1306 allocation failed");
     };
      display.setTextWrap(false);
      display.setFont(&Basic_Comical_Regular_NC7pt7b);
      display.clearDisplay();
      if(oled_orient){ display.setRotation(2); } else { display.setRotation(0); };
      display.dim(false);
      display.setTextColor(WHITE);
      display.setTextSize(1);
      display.setCursor(0,10);
      display.print("         Welcome to");  
      display.setCursor(0,28);
      display.print("   Esp32 LoRa Beacon ");  
      display.setCursor(0,46);
      display.print("       by SARIMESH");  
      display.display();  
    #endif  // end of Adafruit OLED SSD1306 library
  }; // end of if has_SSD1306

  vTaskDelay(pdMS_TO_TICKS(3000)); // let's display our banner for few seconds!

  if(has_SSD1306){
    #ifdef USE_SSD1306_ASCII_LIB   // uses task2 for loop: disabled  uncommento to re-inable
      display.clear();
      display.setRow(1);
      display.println( VersionBanner.c_str()); 
      display.setRow(4);
      display.println("        Booting...."); 
    #else   // Adafruit OLED SSD1306 library
      display.clearDisplay(); display.display();
      display.setTextWrap(false);
      if(oled_orient){ display.setRotation(2); } else { display.setRotation(0); };
      display.setTextColor(WHITE);
      display.setFont(&Basic_Comical_Regular_NC6pt7b);        
      display.setCursor(0, 30); display.print( VersionBanner.c_str()); 
      display.setCursor(40, 45); display.print( "Booting....");  
      display.display();  
    #endif  // end of Adafruit OLED SSD1306 library
  }; // end of has_SSD1306

