US1GHQ/ESP32_LoRa_APRS_SARIMESH/src/ESP32_Sarimesh_Core_Vr_4.0.2.cpp
#ifdef HMQ_MQTT_ENABLE  
if(mqtt_enable){
  HMQ_setupMQTT();  // setup HiveMQ connection
  };
#endif

// setup MQTT vpn
#ifdef HMQ_MQTT_VPN_ENABLE
  Serial.println("Starting VPN Arduino ESP32"); // will be shown in the terminal
  Serial.setDebugOutput(true);
  esp_log_level_set("*", ESP_LOG_VERBOSE);
  IP4_ADDR(&vpn_ipaddr, 10,0,1,2);
  IP4_ADDR(&vpn_netmask, 255,255,255,255);
  IP4_ADDR(&vpn_gw, 0,0,0,0);
  mqtt_vpn_if_init(vpn_broker, vpn_mqtt_user, vpn_mqtt_password, "mqttip", vpn_password, vpn_ipaddr, vpn_netmask, vpn_gw);
#endif

#ifdef AIO_MQTT_ENABLE  
  // Adafruit IO MQTT brocker connection test setup
  mqtt.subscribe(&onoffbutton);
  // start MQTT loop tiker driven  
  tk_mqtt.attach(10,loop_mqtt);
#endif


#ifdef DUTY_CYCLE_MONITOR_ENABLE
  // start DutyCycle monitor tiker driven
  tkDutyCycle.attach(60,DutyCycle_Monitor);
#endif

#ifdef LORA_FUNCTIONS_ENABLE
  //********************************** LoRa setup  *****************************************
  // initialize LoRa device and communication
  //   if(syslog_available) syslog.log(LOG_INFO, "========= initialize LoRa_Device_Handler ===========");

// following ifdef to be replace by autodetection with new generation lora carriers
#ifdef LORA_MODULE_TYPE_SX1268
  LoraDeviceType = 1 ;   // lora device generation -1= not jet identified  0=first generation 1=second generation 
  debugA("Assuming Second Generation LoRa module installed.... \r"); 
#else
  LoraDeviceType = 0 ;   // lora device generation -1= not jet identified  0=first generation 1=second generation 
  debugA("Assuming First Generation LoRa module installed.... \r"); 
#endif

  debugA("\rUsing LoRaDevice=%s - LoraDeviceType=%d \r", LoRaDevice.c_str(), LoraDeviceType ); 
  LoRa_Device_Handler_setup();   // alternative operation mode to avoid SPI mutexing...
  debugA("LoRa_Device_Handler should be now up&running \r"); 
  debugA("Setup Radiolib_LoraPrs deferred to later.... startup will be managed by loop_Lora_aprs \r"); 
  BCN_Controller_flag = false ;  // disable BCN_Controller ---
  debugA("Setup Radiolib_BCN deferred to later.... startup will be managed by loop_Lora_BNC \r"); 




#endif // LORA_FUNCTIONS_ENABLE

//*************************  activate Ticker managed activities  *******************************
if(syslog_available) syslog.log(LOG_INFO, "========= initialize Ticker managed activities ===========");
tkSecond.attach(1,Second_Tick);  // manage adminmode timeout

};  // end of NON admin mode activated functions


// Following functions will be active in either Admin mode or NON Admin Mode ( then always active...) 

#ifdef NET_UPSTREAM_MON_ENABLE
  if(! standalone ){     
    debugA("NetworkUpstreamMonitor: starting periodic check (60 sec).... \r");
    tk_upstream_mon.attach(60,NetworkUpstreamMonitor);
  };

#ifndef APRS_IS_DISABLE
  if( ! standalone ) {
    debugA("APRS-IS_UpstreamMonitor: starting periodic check (70 sec).... \r");
    tk_aprsis_mon.attach(70,AprsMonitor);
    aprsis_available = false ; 
  };
#endif

#endif

debugA("check_time_sync_source_availability: starting periodic check (120 sec).... \r");
tkTimeSync.attach(120,check_time_sync_source_availability);  // manage TimeSyncCheck timeout

debugA("ESP32 chip temperature indication = %6.2f\r", temperatureRead() );
cpu_temp = temperatureRead();

#ifdef TEMPERATURE_MONITOR_ENABLE
  debugA("print_temperature: starting periodic check (60 sec).... \r");
  tk30Second.attach(60,print_temperature);
#endif

// let's start the LocationManager and flag for gps_fix_static
if(has_GPS && ! no_gps) {
  LocationManager_flag = true ;      // handles device geo location infos
  gps_fix_static = 0 ;
  }
else {
  gps_fix_static = 1 ;
  };


// end of setup - start main loop to service web interface
green_red_flash(); 
last_millis=millis();
  
configTime(gmtOffset_sec, daylightOffset_sec, ntpServer.c_str());
printLocalTime();
soundBuzzer(); vTaskDelay(pdMS_TO_TICKS(500)); soundBuzzer();

//*************** show_HW_Device_Config *****************
//  debugA("\rshow_HW_Device_Config: after system startup....\r"); 
//  show_HW_Device_Config();

// re-init SSD1306 display just in case ( display library incompatibility with multitasking...)
debugA("Starting Main loop at now=%d - millis=%d\r",ezt::now(),millis());  last_display_update=ezt::now(); 
//  debugA("*********************************************\r");

write_event_to_log("========= system reboot completed ===========");
// Severity levels can be found in Syslog.h. They are same like in Linux syslog.
if(syslog_available) syslog.logf(LOG_INFO, "System %s reboot completed at %s", SyslogDeviceName.c_str(),(UTC.dateTime(ezt::now(), "d/n/Y H:i:s.v T")).c_str());

// int iteration = 1;
// Log message can be formated like with printf function.
//  syslog.logf(LOG_ERR,  "This is error message no. %d", iteration);
//  syslog.logf(LOG_INFO, "This is info message no. %d", iteration);

// You can force set facility in pri parameter for this log message. More 
// facilities in syslog.h or in Linux syslog documentation.
//  syslog.logf(LOG_DAEMON | LOG_INFO, "This is daemon info message no. %d",  iteration);

// F() macro is supported too
//  syslog.log(LOG_INFO, F("End loop"));
// iteration++;

debugA("LastFunction=%s\r", LastFunction.c_str());
display_event = 7 ;  // show waiting for LoRa spot on local display

debugA("End of setup... Entering Main loop\r\n");

}  ;  // End of setup activities


/**************************************************************************
  Main loop function, called once 'setup' is complete 
**************************************************************************/
void loop ( void ) {
  LastFunction = __func__ ;  
  //============================== activity led enable ================================================     
  uint32_t timeBeginLoop = millis();  // main loop monitoring
  bool volatile loop_debug = true;
  loop_time = millis() - last_millis ;
  if ( loop_time >= 1000 ){ // just try to perform this check every 1000 milliseconds... 
    activity_start = millis(); activity_flag = true;
    last_millis=millis();
    GREEN_LED_enable(); 
    if( (loop_time >= 1900 ) && loop_debug ){
      debugA("====> FreeMem:%d - millis=%d - loop_time=%d - activity_time=%d - uptime=%lld - time_jitter=%ld - UTC.dateTime: %s\r", ESP.getFreeHeap() , millis(), loop_time , activity_time,  esp_timer_get_time(), time_jitter, (UTC.dateTime(ezt::now(), "d/n/Y H:i:s.v T")).c_str());
//     if(syslog_available) syslog.logf(LOG_INFO, "FreeMem:%d - millis=%d - loop_time=%d - activity_time=%d - uptime=%lld - time_jitter=%ld - UTC.dateTime: %s ", ESP.getFreeHeap() , millis(), loop_time , activity_time,  esp_timer_get_time(), time_jitter , (UTC.dateTime(now(), "d/n/Y H:i:s.v T")).c_str());
      if(syslog_available) syslog.logf(LOG_INFO, "loop_time=%d - act_time=%d - time_jitter=%ld - uptime=%lld - UTC.dateTime: %s ", loop_time , activity_time,  time_jitter,  esp_timer_get_time(), (UTC.dateTime(ezt::now(), "d/n/Y H:i:s.v T")).c_str());
    };
  };

  // START_APPLICATION_TAG 

  if( ! Admin_Mode) {   // application_part
    //******************** LoRa services handling  **************************************
    #ifdef LORA_FUNCTIONS_ENABLE
    loop_Lora_native();            // LoRa native service subsystem monitor
    loop_Lora_aprs();              // LoRa APRS service subsystem monitor
    LoRa_Device_Handler_loop();    // LoRa_Device_Handler_loop
    #endif // LORA_FUNCTIONS_ENABLE

    //=========================== HMQ MQTT service loop =====================================================
    #ifdef HMQ_MQTT_ENABLE 
    if(mqtt_enable){
      HMQ_loop_MQTT() ;   // keep alive mqtt server connection
      };
    #endif
  };  // end of activities to be performed ONLY when NON in Admin mode

